{
  "id": "beyond-daos-evolving-human-organization",
  "sourceId": "beyond-daos-evolving-human-organization",
  "eventId": "devcon-5",
  "title": "Beyond DAOs: Evolving Human Organization",
  "description": "The hegemonic approach to human coordination (i.e. nation states, corporations) is being challenged as those underserved and disempowered by the current system search for more open, adaptable, and representative solutions. With the emergence of DAOs, decentralized governance, and token economics, we now have a new design space to engineer incentives and mechanisms that align human behavior. Projects like Aragon, DAOstack, Fairmint, Gnosis, Gitcoin, Commons Stack, and MolochDAO are all building, experimenting, and testing new ways to fund and govern human organizations. We want to build organizations that encourage sustainability over profit, stimulate regeneration instead of scarcity, and eliminate stakeholder misalignment seen in current cooperative models. To truly impact those outside the Ethereum ecosystem, we should be strategically aligning experimentation around counter-hegemonic goals and visions. Only then will we be able to move 'beyond DAOs' into an evolved future of regenerative, sustainable, and cooperative human organization. This workshop aims to:\n-Spark discourse and discussion on what future we're ACTUALLY building towards - Get those experimenting with new organizational models in the same room to discuss collaborative strategy, insights, and roadmaps - Workshop common frameworks and visions for new organizational models to eliminate project silos, form counter-hegemonic strategies, and move the whole ecosystem forwards.",
  "track": "Governance & Coordination",
  "type": "Breakout",
  "expertise": "Beginner",
  "tags": [
    "Governance & Coordination"
  ],
  "speakers": [
    "abigael-titcomb"
  ],
  "sources_youtubeId": "gvlxxkiZNDw",
  "sources_ipfsHash": "QmY4QCLmTwNDw67EzSibT537L2HUWwfbzhxbCFoX83Vhwa",
  "sources_swarmHash": "23758e38a840811974ab9e80c9451953b87b96eff9f5cc82865f7e494e377a39",
  "duration": 3771,
  "language": "en"
}