{
  "id": "building-a-decentralized-bitmex-using-an-optimistic-financial-contract-ofc-framework-new-tools-for-fast-and-secure-financial-contracts-on-ethereum",
  "sourceId": "building-a-decentralized-bitmex-using-an-optimistic-financial-contract-ofc-framework-new-tools-for-fast-and-secure-financial-contracts-on-ethereum",
  "eventId": "devcon-5",
  "title": "Building a Decentralized BitMEX Using an Optimistic Financial Contract (OFC) Framework: New Tools for Fast and Secure Financial Contracts on Ethereum",
  "description": "We introduce the Optimistic Financial Contract (OFC) framework, a novel approach to financial contract design that allows for hyper fast, secure, and scalable DeFi contracts *without* requiring an on-chain price feed. This framework makes it easy for developers to build otherwise complex synthetic financial derivatives on Ethereum. We show how this design can be used to build a decentralized derivatives exchange (aka BitMEX) that can be as performant as the centralized alternatives. How it works: optimistic contracts work by assuming contract participants will act optimistically to avoid penalties. This formalization borrows heavily from Plasma and state channel research. “Long” contract participants enforce that “shorts” remargin contracts on a timely basis (and vice versa). Surprisingly, no on-chain price feed is required—an oracle is *only* needed to resolve disputes in what is conceptually similar to Plasma’s exit games. This simple framework works at both the L1 and L2 levels and can be extended to create almost any type of financial contract developers can imagine.",
  "track": "Developer Infrastructure",
  "type": "Breakout",
  "expertise": "intermediate",
  "tags": [
    "Developer Infrastructure",
    "technical"
  ],
  "speakers": [
    "hart-lambur",
    "allison-lu"
  ],
  "sources_youtubeId": "4Uwznzfne1w",
  "sources_ipfsHash": "QmPxpfTpfrNS7KL167YsRmJfag4PzTFxJ5fKpjoKPwNYrF",
  "sources_swarmHash": "c2cd978ed5f4272d7da54dcfe04ca1544a4b6408e78a9d717ceb8499d66dadef",
  "duration": 1291,
  "language": "en"
}