{
  "id": "coala-workshop-model-law-for-daos",
  "sourceId": "coala-workshop-model-law-for-daos",
  "eventId": "devcon-5",
  "title": "COALA Workshop: Model Law for DAOs",
  "description": "The number of DAOs is growing, and yet most of these DAOs still cannot interact with legal entities, because they do not have legal personality or legal capacity. This workshop is aimed at drafting model legislation for governments to recognize DAOs as legal persons, provided that they possess specific characteristics that facilitate interaction with third parties, and that they provide minimum guarantees of soundness, oversight and accountability.  The goal is not to create new types of corporate entities that could accommodate a DAO (c.f. the approach taken by Vermont and Malta), but rather to carve out some kind of legal recognition to DAOs that subsists in an “alegal” state (a.k.a in the blockchain world) and not in a particular geographic jurisdiction in which they would otherwise need to be incorporated. To the extent that blockchain technology has newly endowed DAOs with both technical and economic agency (c.f. their ability to own crypto-assets and to enter into smart contract relationships), it has become crucial for national jurisdictions to recognize these new technical opportunities, and grant DAOs with some kind of legal personality and legal capacity in order to enable these technical affordances and match them with newfound legal affordances. This work requires building a definition of who are the DAOs that should be recognized as legal persons, and what are the legal or technical requirements they should comply with to avail themselves of legal personality and legal capacity. Once this preliminary work has been done, we will work on drafting a model law for DAOs that could be adopted by a variety of national jurisdictions.",
  "track": "Governance & Coordination",
  "type": "Breakout",
  "expertise": "advanced",
  "tags": [
    "Governance & Coordination",
    "technical"
  ],
  "speakers": [
    "constance-choi",
    "anuj-das-gupta"
  ],
  "sources_youtubeId": "bUn1Y8Blvwc",
  "sources_ipfsHash": "QmVKKdbkrE8EEzYfJ1Y85GttLiC1iGQ5XQSEwRCnMdGyZ4",
  "sources_swarmHash": "312ea2afb2ee9a4b362310b9ecb444b9a0b1cf49d4c34a5d158e7c5a639c1bf0",
  "duration": 2711,
  "language": "en"
}