{
  "id": "ethlagos-onboarding-developers-and-laying-a-foundation-for-1billion-people",
  "sourceId": "ethlagos-onboarding-developers-and-laying-a-foundation-for-1billion-people",
  "eventId": "devcon-5",
  "title": "ETHLagos: onboarding developers and laying a foundation for 1billion + people",
  "description": "Through firsthand experience, our group of EF devs realized that hackathon participants often lack sufficient knowledge to create meaningful projects within the short timeframe of a hackathon event. This has led us to create a concept called ETHimpact. ETHimpact is introducing a novel approach to solving social and global challenges. By creating an inclusive environment and bringing together developers, designers, and industry experts into a week-long program to learn and co-create decentralized solutions for social impact, we effectively break down barriers between groups with a shared vision to drive towards a sustainable future. Our team is now made up of motivated individuals from all walks of life. We are supported by the EF, the German Development agency (GIZ), as well as local initiatives like the Africa Blockchain Alliance. We do not only end our engagement with the hackers after the hackathon/event, but will continue to work with the winning teams to build out the solutions into sustainable impactful projects.  ETHLagos is the first iteration of this concept, and we would like to introduce it to the world at Devcon. In this first edition, we will focus on decentralized energy solutions: an area of prime importance for Nigeria in the wake of its current energy crisis. We chose Lagos because it is a thriving techhub in Africa, and because we’ve realized that decentralization is not a new concept to Nigerians and Africans in general. Ancient civilizations within Nigeria and Africa have governed themselves using decentralised concepts for centuries. Examples include consensus mechanisms, oracles and state channels. The ancient civilizations of Ife, Benin and Igbo communities within Nigeria have used these concepts and still use them today. This has also made it easier for the concepts of decentralization to be understood and accepted across Africa and helped in building a thriving community of blockchain enthusiasts on the continent through the Africa Blockchain Alliance.  One of the fruits of the African community effort is the Ribbon Blockchain built on Ethereum. Ribbon seeks to automate public health through tokenized incentives. Ribbon enables crowdfunding for public health programs, then distributes proceeds as incentives to patients and healthcare practitioners to encourage healthier lifestyles and quality healthcare delivery. Funding is sent directly to patients, community health workers and healthcare practitioners; where the funding is used for preventative care, adherence to medication, quality care delivery and overall population health outcomes. A demo of the incentives app will be showcased.  We believe that many more impactful projects in the energy space and more areas will emerge from this concept which we will keep supporting in solving some of the world’s most pressing challenges.",
  "track": "Governance & Coordination",
  "type": "Breakout",
  "expertise": "Beginner",
  "tags": [
    "Governance & Coordination"
  ],
  "speakers": [
    "guillaume-ballet",
    "maurice-von-glasenapp",
    "eseoghene-mentie",
    "benjamin-onuoha",
    "rob-stupay"
  ],
  "sources_youtubeId": "oQ60o-PP6t8",
  "sources_ipfsHash": "QmcbnvAfW2kXywYnytEZWwvuN449PqiJkupAvBNkgjzhvt",
  "sources_swarmHash": "1ebd6d955f2d6a758ea87ddc77821d1a2fe0cd9ba79cff00bae808d8b754b0d5",
  "duration": 1220,
  "language": "en"
}