{
  "id": "formal-verification-of-smart-contracts-made-easy",
  "sourceId": "formal-verification-of-smart-contracts-made-easy",
  "eventId": "devcon-5",
  "title": "Formal verification of smart contracts made easy",
  "description": "In this hands-on workshop, we will go through the process of formally verifying smart contracts. The attendees will learn (1) how to formally specify relevant functional requirements of Ethereum contracts, such as \"the sum of deposits never exceeds the contract’s balance\", and (2) how to verify these using existing analysis tools for Ethereum. First, we will show how to formally specify the intended behavior of smart contracts. We will look closer at safety temporal properties, an expressive class of properties for capturing which sequences of contract states are considered correct. We will present common requirement idioms, including access control, state-based properties, multi-contract invariants, and others. Next, we will provide an overview of existing testing tools, such as tools based on symbolic execution and fuzzers. The goal is to understand how they can be used to identify violations of the formalized properties as well as their limitations in providing unbounded formal guarantees. Finally, we will learn how formal verifiers go beyond testing and can provide unbounded formal guarantees (for any sequence of transactions). We will take a closer look at the specification language used by VerX and its automated verification method, which is easy to use and does not require in-depth knowledge in formal verification.",
  "track": "Security",
  "type": "Breakout",
  "expertise": "intermediate",
  "tags": [
    "Security",
    "technical"
  ],
  "speakers": [
    "dimitar-dimitrov",
    "anton-permenev",
    "hubert-ritzdorf",
    "petar-tsankov"
  ],
  "sources_youtubeId": "tq5XH3JedqM",
  "sources_ipfsHash": "QmPuX9NV1Yvv927pCaxjY5qWYpBTU6Bysph6XLx6LnegEg",
  "sources_swarmHash": "786ac5072ed758aaa24c57d4aad00059c72dd722f6c8d0137942d2a1a01a931e",
  "duration": 4261,
  "language": "en"
}