{
  "id": "governance-strategy-for-maximum-fork-readiness",
  "sourceId": "governance-strategy-for-maximum-fork-readiness",
  "eventId": "devcon-5",
  "title": "Governance Strategy for Maximum Fork Readiness",
  "description": "In this workshop, we will present a case which will concern a fictional blockchain with characteristics similar to Ethereum and a potential fork of that blockchain. Based on an imaginary event, but with realistic elements, the fork will be linked to the phenomenon of tech giants issuing their own currency. We will present all the known facts of the case, important stakeholders, relevant circumstances of the fork, actions taken by individuals and the community as well as the rest of the information that influenced decisions taken by the involved parties. We will create three claims for each party which together form a dispute between primary blockchain community and the forked community.  Attendees will be asked to form argumentation for both sides, analyzing and applying current customs, norms, and protocols with respect to crypto law and already existing practice in the blockchain community. The objective of the workshop is to form an interdisciplinary cooperation and practice combinations of expertise needed to create persuasive and complex argumentation. They will take into account practicalities, e.g. protocol design, the politics and efforts of stakeholders as well as the usual scenarios, communication management, expected public relation management, intellectual property hacks, and standard business ethics.",
  "track": "Governance & Coordination",
  "type": "Workshop",
  "expertise": "Beginner",
  "tags": [
    "Governance & Coordination"
  ],
  "speakers": [
    "anja-blaj",
    "marina-markezic"
  ],
  "sources_youtubeId": "gqgnFs0buFo",
  "sources_ipfsHash": "QmbAwg3o9dRmpUPeroekBUVSSKewTKZzc8ujp2uHyHghJS",
  "sources_swarmHash": "2ad27a2d55d30e30dcf49cb8e216dd4336c7e57c34247416c07a6b8891831219",
  "duration": 5344,
  "language": "en"
}