{
  "id": "how-we-think-about-storing-crypto-is-broken",
  "sourceId": "how-we-think-about-storing-crypto-is-broken",
  "eventId": "devcon-5",
  "title": "How We Think About Storing Crypto is Broken",
  "description": "The original sin of cryptocurrency is not transaction speed, poor anonymity, volatility or a high Gini coefficient -- it's a digital format which is confusing to use, easily delegated to centralized exchanges and, most importantly, reliant on multiple layers of software and hardware trust. What if instead Bitcoin and Ethereum were like cash, a physical format that billions of people are intimately familiar with? To achieve a viable physical cryptocurrency, however, we need radically open hardware with cryptographically-secured guarantees of their face value and uniqueness anchored in silicon. We propose a novel, low cost, physical format for cryptocurrency -- more appropriately \"cryptocash\" -- that's intuitive to use and allows for free, anonymous, and instantaneously final transactions. By isolating cryptographic key material and operations from software and firmware in secure silicon, we can build a new hardware foundation that supports not only self-ownership of crypto assets, but broadly serves to secure the secrets users need for participation in the decentralized web. We'll hone in how shared trust in hardware and chips must ultimately be quantified through crypto-economic incentives such that we can move away from manufacturers that willfully or ineptly include backdoors in their products.",
  "track": "Governance & Coordination",
  "type": "Talk",
  "expertise": "Beginner",
  "tags": [
    "Governance & Coordination",
    "storage",
    "wallets",
    "general"
  ],
  "speakers": [
    "cameron-robertson"
  ],
  "sources_youtubeId": "DIdXITuTbVY",
  "sources_ipfsHash": "QmY3oyakXpMHHEZzKwPJex597B6j81Q67iTFouEwxxpifw",
  "sources_swarmHash": "a3cd149859b9b50aa0d8fe374c06a19a5b3f7dc4b0eea2f322a7cd4a5c48c0be",
  "duration": 787,
  "language": "en"
}