{
  "id": "instability-for-the-blockchain-deleveraging-spirals-and-stablecoin-attacks",
  "sourceId": "instability-for-the-blockchain-deleveraging-spirals-and-stablecoin-attacks",
  "eventId": "devcon-5",
  "title": "(In)Stability for the Blockchain: Deleveraging Spirals and Stablecoin Attacks",
  "description": "We develop a model of stable assets, including noncustodial stablecoins backed by cryptocurrencies. Such stablecoins are popular methods for bootstrapping price stability within public blockchain settings. We demonstrate fundamental results about dynamics and liquidity in stablecoin markets, demonstrate that these markets face deleveraging spirals that cause illiquidity during crises, and show that these stablecoins have `stable' and `unstable' domains. Starting from documented market behaviors, we explain actual stablecoin movements; further our results are robust to a wide range of potential behaviors. In simulations, we show that these systems are susceptible to high tail volatility and failure. Our model builds foundations for stablecoin design. Based on our results, we suggest design improvements that can improve long-term stability and suggest methods for solving pricing problems that arise in existing stablecoins. In addition to the direct risk of instability, our dynamics results suggest a profitable economic attack during extreme events that can induce volatility in the `stable' asset. This attack additionally suggests ways in which stablecoins can cause perverse incentives for miners, posing risks to blockchain consensus.",
  "track": "Governance & Coordination",
  "type": "Breakout",
  "expertise": "Advanced",
  "tags": [
    "Governance & Coordination",
    "academic"
  ],
  "speakers": [
    "ariah-klages-mundt",
    "andreea-minca"
  ],
  "sources_youtubeId": "qOi50UtxL7A",
  "sources_ipfsHash": "QmbyXixmb8FxruUg8pkn3t2hAaoKPGiiCu6p8cC1ppemMg",
  "sources_swarmHash": "362b9f864b342ea1dd9d06904da7ce29639c2a9d559ffca097c5c7585b6ad048",
  "duration": 1232,
  "language": "en"
}