{
  "id": "japanese-human-readable-smart-contracts",
  "sourceId": "japanese-human-readable-smart-contracts",
  "eventId": "devcon-5",
  "title": "Japanese, Human-Readable Smart Contracts",
  "description": "This workshop invites native or fluent Japanese speakers to create a Japanese-based smart contract language to create Ethereum smart contracts with that can be read by anyone who understands Japanese, and deployed directly to the Ethereum mainnet. Speakers of other languages who are interested in facilitating a Lexon variant based on their language are also invited to understand the process of adaption. The attempt is based on the Open Source, human-readable smart contract language Lexon that is a subset of natural English. This workshop is a hackathon-like event where the Lexon compiler source code and grammar is altered to see if a Japanese version of Lexon is possible. Coding skills are NOT required from participants. Lawyers and impact-oriented participants are highly welcome. Only one or two programmers — likely the tutor — will be working on code. The actual work will be for the audience to understand how the Lexon grammar is structured and to propose what has to be changed to make it work with Japanese. The result may be a working Lexon compiler for smart contracts written in Japanese, that anyone who can read Japanese can understand, and that can be compiled and run on the Ethereum main- and testnet immediately. This is possible because the Lexon grammar is relatively concise and changes to it can be made in a straight forward way that could lead to immediate results. At the least some experimental output should be achieved from an alpha version of a Japanese Lexon compiler. This is a different proposal from the workshop that teaches people how to write human-readable smart contracts in English. This Workshop is complementary, hands-on research part to the proposed 20-minute session about Human-Readable Smart Contracts. It will allow participants to shape the way forward for the project. (For your convenience, the following is a repeat from the complementary 20-minute session application that focusses on reading and the science behind it. 'Human-readable' smart contracts expand the audience of people who can read smart contracts by a thousand times. They democratize them beyond the ranks of developers and provide a means for expert validation, human debate and consensus. Lexon is a new type of program language that can be read by anyone without any preparation, made to create smart contracts that run on the Ethereum mainnet. It has been built from the ground up, over the course of two years, to allow lawyers and non-programmer experts to understand first-hand what a smart contract means. The result turns out to be enlightening for any community that wishes to allow their non-technical members to read for themselves what its DAO or smart contract code actually means. Turns out that's everyone except re-centralizing start ups.\nLEX Escrow Contract.\n“Payer” is a person. “Payee” is a person. “Arbiter” is a person. “Fee” is an amount. The Payer pays an Amount into escrow, appoints the Payee, appoints the Arbiter, and also fixes the Fee.\nCLAUSE: Pay Out. The Arbiter may pay from escrow the Fee to themselves, and afterwards pay the remainder of the escrow to the Payee.\nCLAUSE: Pay Back. The Arbiter may pay from escrow the Fee to themselves, and afterwards return the remainder of the escrow to the Payer.  The enclosed paper draft explains the concept in-depth and has longer examples. Lexon is an Open Source project by the Lexon Foundation. It was created by the presenter and implemented by Marcelo Alaniz, Nicolas Guzzo and him.",
  "track": "Governance & Coordination",
  "type": "Breakout",
  "expertise": "Beginner",
  "tags": [
    "Governance & Coordination"
  ],
  "speakers": [
    "henning-diedrich"
  ],
  "sources_youtubeId": "H4s91y8UzsQ",
  "sources_ipfsHash": "QmXeCbxdqSP4dbcUV8Bxqpq31AFV4GE4aXe8p2fdnQyDJJ",
  "sources_swarmHash": "e31035fa8224314c810068c60ceef1678e7cb68fc0a575e210f73bc007537d85",
  "duration": 3081,
  "language": "en"
}