{
  "id": "measuring-decentralization-of-blockchain-networks",
  "sourceId": "measuring-decentralization-of-blockchain-networks",
  "eventId": "devcon-5",
  "title": "Measuring Decentralization of Blockchain Networks",
  "description": "We introduced the concept of measuring \"decentralized transactions per second\" in this paper (https://consensys.net/research/the-maximally-decentralized-settlement-layer/) and have invited the community to help us define it. We will have data and insights to share at the time of DevCon V.  Decentralization is a fundamental blockchain concept, but how to actually determine or quantify decentralization—and consequently, how to value one blockchain’s potential over another—is more complicated. Currently, transactions per second throughput is the most popular competitive metric for comparing blockchains, but this emphasis on speed ignores the essential feature of decentralization.  In Balaji Srinvasan’s 2017 \"Quantifying Decentralization,\" he proposed the use of the Gini and Nakamoto coefficients to attach an objective measure of decentralization to a blockchain. By applying Srinvasan’s logic of measuring comparable blockchain characteristics (i.e. node decentralization) and representing it numerically, we propose a measurement we can call DTPS, or decentralized transactions per second. The purpose of DTPS is to factor a blockchain’s decentralization into the ecosystem debate of judging one blockchain’s transaction throughput against another’s. There does not exist, however, a way to factor all that information into a single comparable statistic that factors in near-objective decentralization with objective TPS.",
  "track": "Governance & Coordination",
  "type": "Breakout",
  "expertise": "Advanced",
  "tags": [
    "Governance & Coordination",
    "academic"
  ],
  "speakers": [
    "mally-anderson",
    "everett-muzzy"
  ],
  "sources_youtubeId": "a55JLF0uEaA",
  "sources_ipfsHash": "Qmc3udcq1x845HKtgT2xNJmt2unGRLwihQ8QS5qiWDvFDY",
  "sources_swarmHash": "9589da69219d8b33c4801fbbf175c2c74e87e39f14b033c2475d740d59b5b5ee",
  "duration": 1255,
  "language": "en"
}