{
  "id": "peers-and-intermediaries-in-indonesias-p2p-economy",
  "sourceId": "peers-and-intermediaries-in-indonesias-p2p-economy",
  "eventId": "devcon-5",
  "title": "Peers and Intermediaries in Indonesia’s P2P economy",
  "description": "While ‘peer-to-peer’ emerged as a technical term, growing traction means it is increasingly used to describe a wide variety of complex socio-economic transactions. Anthropologist Keith Hart observed that “A lot more circulates with money than the goods and services it buys. Money conveys meanings and these tell us how we make the communities we live in.”  Arguably, the exchange of digital money also comprises far more than a simple financial transaction, and far more than can be summarised in an elegant acronym. Who are these so-called peers? Who are these (multiple) intermediaries, subtly obfuscated behind the ‘2’, and why do people rely on them? And what does disintermediation mean in such a context?  This talk unpacks these questions, by drawing on ethnographic research on the use of digital payments in Yogyakarta, Indonesia. It analyses the various relationships between different types of users and the power and responsibility that the intermediaries have in configuring socio-economic dynamics when developing technology.  The talk shows how ‘access’ to financial services and technologies is neither a binary nor static category. Rather, providing a viable technological alternative to conventional financial services means supporting people’s ability to transition flexibly between forms of digital and tangible money.",
  "track": "Governance & Coordination",
  "type": "Breakout",
  "expertise": "Advanced",
  "tags": [
    "Governance & Coordination",
    "academic"
  ],
  "speakers": [
    "sunniva-sandbukt"
  ],
  "sources_youtubeId": "CVA9069rO4I",
  "sources_ipfsHash": "QmQVYPeefAZ2oXA3BUrCGeAys7x8HnEY6jxzZ4DGoiaDNt",
  "sources_swarmHash": "05b3bdfd5ff44755bd39885bf86e11a7c7eef86ede55ad945eb3a70601f28c66",
  "duration": 1231,
  "language": "en"
}