{
  "id": "standardized-incentives-on-ethereum-a-round-table-discussion-about-standardbounties",
  "sourceId": "standardized-incentives-on-ethereum-a-round-table-discussion-about-standardbounties",
  "eventId": "devcon-5",
  "title": "Standardized Incentives on Ethereum: a round-table discussion about StandardBounties",
  "description": "Since it's inception at the beginning of 2017, the StandardBounties \"protocol\" (group of smart contracts) has aimed to create a generalized and robust interface for dapps on Ethereum to manage bounties. These would be useful not only for work-like incentive schemes (like outsourcing coding or design tasks), but also for more nascent use cases like incentivizing social impact. The goal here was to create shared/open source \"order book\" of incentives which individuals or teams had put up, with the intention that bounties could be easily created within one dapp, and fulfilled on another.Since then, we've seen great interest in StandardBounties, with the protocol already being used to power bounties on Gitcoin and Bounties Network, while also working with DAOStack, Aragon, Giveth, ETHLance, and other teams to have them integrate and use a shared standard. Although this endeavour has been difficult (owing to the friction of coordinating individuals), we've worked hard to have StandardBounties be a collaboratively crafted, and collectively used protocol. This implies that the protocol isn't \"open\" just because its code is open source; it's open because multiple competing stakeholders are coordinating around the same contracts to the benefit of their users.This breakout room will be used to facilitate an open discussion among the aforementioned parties (Gitcoin, Bounties Network, DAOStack, Aragon, Giveth, ETHLance, etc) as well as any others who wish to partake, in order to discuss any changes or new features which may be necessary in the contract's evolution, and ensure things are running smoothly between the collaborating parties.",
  "track": "Developer Infrastructure",
  "type": "Breakout",
  "expertise": "Intermediate",
  "tags": [
    "Developer Infrastructure"
  ],
  "speakers": [
    "mark-beylin"
  ],
  "sources_youtubeId": "reGM6Fu_-5U",
  "sources_ipfsHash": "QmToqWjvc9WSebLvRpMYSdCLkhujQEvArexyVrtecrMsPW",
  "sources_swarmHash": "8c8921dba0f45bf5148ad20deb4b0f1fc2f9643bc975fbae0b11ba71cc06b69e",
  "duration": 3536,
  "language": "en"
}