{
  "id": "state-of-blockchain-governance-breakout",
  "sourceId": "state-of-blockchain-governance-breakout",
  "eventId": "devcon-5",
  "title": "State of Blockchain Governance Breakout",
  "description": "Governance is a hot topic in Ethereum and other blockchain communities in 2019, and for good reason. Blockchain tech continues to evolve rapidly, but our \"social infrastructure\" lags and major blockchain communities including Ethereum haven't invested nearly as much in building robust, socially scalable governance as they have in scalable tech. This governance-focused breakout session will invite core stakeholders from major blockchain platforms, including Ethereum, Tezos, Cosmos, Polkadot, Near Protocol, Zcash, Decred, and Spacemesh to present in turn the good, the bad, and the ugly of governance in their ecosystem. It will include talks from academics in fields including economics, political science and philosophy, legal theory, philosophy, and ethics, putting the blockchain governance landscape in the context of the overall evolution of human governance systems since democracy was born in Athens. It will introduce participants to essential governance concepts and challenges such as DAOs, on- and off-chain governance, voting, identity, formal vs. informal governance, governing the commons, and aggregating preferences. The breakout session will include a hands-on \"challenge\" section where participants need to self-organize and race to solve governance challenges in a decentralized fashion, to appreciate how hard the problem is.",
  "track": "Governance & Coordination",
  "type": "Breakout",
  "expertise": "Intermediate",
  "tags": [
    "Governance & Coordination"
  ],
  "speakers": [
    "jacob-arluck",
    "federico-ast",
    "adrian-brink",
    "joshua-buirski",
    "josh-cincinnati",
    "meltem-demirors",
    "hudson-jameson",
    "john-light",
    "jack-platts",
    "illia-polosukhin",
    "lane-rettig",
    "ryan-selkis"
  ],
  "sources_youtubeId": "e8uSxLloH2s",
  "sources_ipfsHash": "QmfQRqETLNNCntakXt493Xb6kQF3pUbriUAmwrCGViKYK9",
  "sources_swarmHash": "db29ca1babea4e01796f2c0ebd8d1ef89e9e9539c680f07574554de96cf8ea04",
  "duration": 10188,
  "language": "en"
}