{
  "id": "weaving-cultural-fabrics-with-tokens",
  "sourceId": "weaving-cultural-fabrics-with-tokens",
  "eventId": "devcon-5",
  "title": "Weaving Cultural Fabrics With Tokens",
  "description": "Many people in the crypto ecosystem have long operated under the same assumptions that Satoshi operated under in his original white paper: that we should assume that there's no trust among actors within an ecosystem, and that they'll make purely rational decisions to benefit themselves. Since then, we've seen the flourishing of tokens, each of which has their own communities with individuals orbiting at various distances. What we've seen practically is that in reality these actors do end up trusting each other in various ways (such as the way that BTC holders all trust each other to enforce a 21M supply cap), and that similarly, actors don't always act rationally (the proof for this point will be left as an exercise for the reader). In light of these updates, it would serve us well to begin thinking of our protocol designs in a manner that not only incorporates the \"hard\" side (the one which treats actors like rational machines), but also the \"soft\" side: the one which takes into account human actors, their emotions, and the cultural fabric or \"soft layer\" which can sit atop the \"hard layer\" for a system to work in its entirety. This \"soft layer\" already exists informally-- on crypto-twitter, in telegram groups, through memes, and at the myriad of conferences which take place year-round in our space. However, there would be significant benefits for us as protocol designers to begin intentionally designing these soft layers alongside the hard layers (even though doing so will necessarily require the input of social scientists and not computer scientists).While many perceive extrinsic incentives (like reputation or value) as being at-odds with intrinsic incentives, this talk will illustrate (with examples) how the issuance and distribution of tokens can enable humans to connect with each other in a decentralized fashion, creating a force which unites them around a set of shared principles or goals. By using tokens not just for utility or fundraising but rather as focal points around which communities may organize, we may begin to intentionally weave these cultural fabrics, to be more successful in building new communities and protocols.",
  "track": "Governance & Coordination",
  "type": "Talk",
  "expertise": "Beginner",
  "tags": [
    "Governance & Coordination",
    "tokens",
    "culture",
    "general"
  ],
  "speakers": [
    "mark-beylin"
  ],
  "sources_youtubeId": "DeV8oKleAag",
  "sources_ipfsHash": "QmSjymhRB7GpoJVaMfJSu5JxgAnk3rc5QGSdGf3BKrPCAJ",
  "sources_swarmHash": "a0a48378a3744a6b36b0bc2a3538d26c1a7004851f2eba0b3d9939be826938b5",
  "duration": 1086,
  "language": "en"
}