{
  "id": "axlang-compiling-scala-to-evm-bytecode-for-secure-and-reliable-ethereum-smart-contracts",
  "sourceId": "axlang-compiling-scala-to-evm-bytecode-for-secure-and-reliable-ethereum-smart-contracts",
  "eventId": "devcon-4",
  "title": "AxLang: Compiling Scala to EVM Bytecode for Secure and Reliable Ethereum Smart Contracts",
  "description": "We present AxLang Backend: a compiler framework for verifiable Ethereum smart contracts, and Axoni’s first step toward releasing an open source full-stack Scala compiler for the Ethereum Virtual Machine (EVM). AxLang Backend significantly improves the ability to optimize, analyze, and verify/audit smart contracts through a standard intermediate representation (IR), a compiler norm that hasn’t previously been used by EVM compilers. Additionally, AxLang Backend can be used by other compilers to target the EVM in a more efficient manner. AxLang Backend consists of four main features: a clean, minimal intermediate language (IL) that serves as an effective compiler target as well as a human readable/writable languagea standard three-address code IR that is convertible to a static single assignment (SSA) form, as is common in widely-used general purpose compiler frameworksa retargetable code-generation module that converts IR into the desired executable codea decompiler that constructs the above IR from Ethereum bytecode produced by other compilers like Solidity. Axoni is developing AxLang because the ability to write verifiable smart contracts is critical to our clients' broad adoption of this technology. AxLang Backend is the underlying structure that makes it possible for AxLang and other high-level languages to efficiently target the EVM.",
  "track": "Developer Infrastructure",
  "type": "Talk",
  "expertise": "Intermediate",
  "tags": [
    "Developer Infrastructure",
    "compiler",
    "language"
  ],
  "speakers": [
    "athanasios-thanasis-konstantinidis"
  ],
  "sources_youtubeId": "0LaGkVX0p4M",
  "sources_ipfsHash": "QmU1yjTKfRotn5uFULghTQoVw7gbmU1H5JceedUrmkoHRU",
  "sources_swarmHash": "5ba906534b6d37aebfb11c299dfe3d6c0c98a92e169cb1e2a33853936eaa496f",
  "duration": 357,
  "language": "en"
}