{
  "id": "high-stakes-decision-making-how-to-maximise-your-impact",
  "sourceId": "high-stakes-decision-making-how-to-maximise-your-impact",
  "eventId": "devcon-4",
  "title": "High-stakes decision making: how to maximise your impact",
  "description": "After 10 years of sharpening my decision-making skills in the world of high stakes poker I discovered effective altruism - an intellectual movement that applies science, evidence and reason to figure out the most impactful ways to address the world’s most pressing problems. Rigorous analysis shows that some non-profits are literally 1000s of times more cost-effective than average. Additionally, a significant portion of well-meaning philanthropic efforts produce little, or even negative effects on the problems they are trying to solve. Considering the many billions that are donated to charity each year, it is crucially important that all philanthropists develop the critical thinking skills to make these tough decisions - skills such as decision-making under uncertainty, correcting for bias and knowing when to (or not to!) use intuition. I expect many of Devcon4’s attendees will strongly resonate with these concepts. As blockchain pioneers, they already understand the dire need for positive social impact on a truly global scale to ensure a safer and fairer future for everyone. Alongside my colleague - philosopher and barrister Natalie Cargill - I will present the decision-making framework that effective altruists use to ensure that the actions we take achieve the most good.",
  "track": "Governance & Coordination",
  "type": "Talk",
  "expertise": "Intermediate",
  "tags": [
    "Governance & Coordination",
    "impact"
  ],
  "speakers": [
    "liv-boeree",
    "natalie-cargill"
  ],
  "sources_youtubeId": "5SMh-hr2wgg",
  "sources_ipfsHash": "QmYP5H4dXze6yNUZW1vcif1wEP38tAgUutB2FXLYuRnXVN",
  "sources_swarmHash": "005032e8bc496a17caab2f507a5568ffbd49e91b2e0ae8fa236e46b8d1d3e90e",
  "duration": 1434,
  "language": "en"
}