{
  "id": "solutions-towards-trusted-and-private-computations-built-by-golem-for-the-wider-ecosystem",
  "sourceId": "solutions-towards-trusted-and-private-computations-built-by-golem-for-the-wider-ecosystem",
  "eventId": "devcon-4",
  "title": "Solutions towards trusted and private computations - built by Golem for the wider ecosystem",
  "description": "Intel SGX is a technology first developed by Intel for the protection of code and data. This an extremely promising technology that will contribute to the development of the blockchain space and is focusing efforts on solutions and further development.Our hard work has allowed us to be positioned as the most advanced team in this field. We are building this solution and open-sourcing it because we believe that our user-friendly product will enable many projects facing challenges like the ones we have faced apply this solution and push other development aspects of their projects. This talk will cover what we have accomplished so far and what are the next steps related to Intel SGX technology development.  We will explain how we have achieved total security and privacy for requestors (people requesting computing power via the Golem p2p marketplace). They can be certain that the data they share is not accessible for the providers and they can be certain that the results are not manipulated. We'll also show how that integrates with our Concent service.Most importantly we will talk about other new possibilities that this technology enables for decentralized computations, explaining how to run arbitrary binaries inside SGX.",
  "track": "Security",
  "type": "Talk",
  "expertise": "Expert",
  "tags": [
    "Security",
    "trust",
    "golem",
    "privacy"
  ],
  "speakers": [
    "piotr-janiuk"
  ],
  "sources_youtubeId": "w0bYO8DOT8A",
  "sources_ipfsHash": "QmZgBM6cWVv8FPMwDCHQxAEHTks5dWPyxQ2CH1SmRnpz4g",
  "sources_swarmHash": "f5bc927c8a2ae5a96bd178cca3a6f89da4c861bc30629cd84f3f5fc62bbfedf3",
  "duration": 1415,
  "language": "en"
}