{
  "id": "fully-distributed-cloud-thanks-to-the-ethereum-blockchain",
  "sourceId": "fully-distributed-cloud-thanks-to-the-ethereum-blockchain",
  "eventId": "devcon-2",
  "title": "Fully Distributed Cloud Thanks to the Ethereum Blockchain",
  "description": "iExec provides the SMI / SME and individuals a scalable, secure and easy access to the application, the data-sets and the computing resources they need. iExec leverages a set of research technologies that have been developed at INRIA and CNRS in the field of Desktop Grid computing (aka Volunteer Computing). The principle is to collect the computer resources underutilized on the Internet to execute very large parallel applications at the fraction of the cost of a traditional supercomputer. Since the early 2000’s we have pushed this idea to its extreme limit by proposing many software and algorithms in the area of large scale data processing, data management, parallel computing, security and dependability, QoS,… iExec relies on XtremWeb-HEP, a mature, solid, and open-source Desktop Grid software which implements all the needed features : fault-tolerance, multi-applications, multi-users, hybrid public/private infrastructure, deployment of virtual images, data management, security and accountability, interoperability with eScience infrastructure, and many more. In this talk, we’ll show how Ethereum can be used to organize decentralised infrastructures and market places, where everyone will be able to rent its computing resources (CPU, storage, GPU, …), where the innovative SMEs which design Big Data and HPC applications will be able to sell them online immediately with the needed resources to run them, and where highly valued data-sets will be rentable with a fine-grain business model. We’ll present some early results that illustrate the interaction between the Ethereum blockchain and regular distributed systems (e.g task scheduler, data management, etc..) Moreover, because the blockchain provides distributed consensus and resiliency while being fully distributed, we think that it’s going to change drastically the way we design distributed systems and applications. We’ll draw some perspectives on blockchain-based infrastructure management, and present the related research directions.",
  "track": "Governance & Coordination",
  "type": "Talk",
  "expertise": "Advanced",
  "tags": [
    "Governance & Coordination",
    "fully",
    "distributed",
    "cloud",
    "blockchain",
    "infrastructure",
    "dapps",
    "security",
    "resilience",
    "miners",
    "computing",
    "power",
    "iexec",
    "offchain",
    "cpu",
    "servers",
    "HEP",
    "scheduling",
    "resource",
    "management",
    "autonomous",
    "sidechain",
    "energy"
  ],
  "speakers": [
    "gilles-fedak"
  ],
  "sources_youtubeId": "aCpv3qLZJWU",
  "sources_ipfsHash": "QmcvZTn796P3qoiQ7SgiSQsSahpd2KsQfyj49dyPJVg5zu",
  "sources_swarmHash": "86170c23a0c2dc4ac96e88300d2b156f2a1fda43019f0049b73ca13b96efbf05",
  "duration": 767,
  "language": "en"
}