{
  "id": "zcash-ethereum",
  "sourceId": "zcash-ethereum",
  "eventId": "devcon-2",
  "title": "Zcash + Ethereum = ❤",
  "description": "This presentation focuses on how Zcash uses zero-knowledge proofs to add private transactions to a public blockchain, and how Zcash and Ethereum will grow together. Zcash is a new cryptocurrency that provides private transactions — the sender’s and receiver’s addresses are not publicly visible in the blockchain, nor is the amount transferred. Zcash posts that private information to the blockchain in encrypted form, and uses zero-knowledge proofs to cryptographically guarantee the validity of transactions without exposing the private information. This results in “Selective Transparency”. It’s not all-dark-all-the-time — it’s that each encrypted transaction in the blockchain can be revealed by its creator to selected third parties. Zcash is developed by a VC-funded, highly skilled development team and a widespread and active open source community. There are three paths forward for integrating Ethereum’s programmability with Zcash’s privacy. The Zcash team is actively contributing to all three paths. 1. Programmable Zcash — add Ethereum-style programmability to the Zcash blockchain 2. Private Ethereum — add Zcash-style privacy to the Ethereum blockchain 3. Project Alchemy — interoperation between the Ethereum and Zcash",
  "track": "Privacy",
  "type": "Talk",
  "expertise": "Intermediate",
  "tags": [
    "Privacy",
    "immutability",
    "encryption",
    "communication",
    "selective",
    "dicslosure",
    "human rights",
    "society",
    "fungibility",
    "data",
    "security",
    "bitcoin",
    "zksnarks",
    "zkproofs",
    "validators",
    "programmability",
    "alchemy",
    "btcrelay"
  ],
  "speakers": [
    "zooko-wilcox"
  ],
  "sources_youtubeId": "PCW2EaBjVPs",
  "sources_ipfsHash": "Qmb9NWsEKDase7EDsoNzBsRmk9qV6wAduGxw6fo2NDwHPo",
  "sources_swarmHash": "1a460bb312459f166216db5523aaeca3cc16dbe7f33ef5e131d0e1000ef8e6e9",
  "duration": 1258,
  "language": "en"
}