{
  "id": "secure-decentralized-oracles-applying-intel-sgx-and-towncrier-to-external-data-payments-and-off-chain-computation",
  "sourceId": "secure-decentralized-oracles-applying-intel-sgx-and-towncrier-to-external-data-payments-and-off-chain-computation",
  "eventId": "devcon-3",
  "title": "Secure Decentralized Oracles: Applying Intel SGX and TownCrier to external data, payments and off-chain computation",
  "description": "We will cover the need for secure and maximally decentralized oracles for Ethereum smart contracts. The focus of the presentation will be on how allowing data providers, payment providers, and various API-based services to be accessed by Ethereum smart contracts through a decentralized oracle network can greatly expand functionality, while maintaining the key security guarantees of smart contracts. We’ll focus on how TownCrier’s approach to implementing Intel SGX enables third party oracles to be provably secure, as is already being done on production using the currently live TownCrier implementation. We’ll also look at how oracle operations and off-chain computation can be written in solidity to be run entirely in an SGX Enclave, allowing provable off-chain computation and retrieval of external resources. Smart contracts need to retain a high level of security in both the network they run on, and the inputs/outputs they rely on, we aim to show how decentralized oracle networks, TownCrier’s approach to using Intel SGX for secure external access , and off-chain computation using solidity in Intel SGX can together allow smart contracts to remain secure as they access key resources outside the Ethereum network.",
  "track": "Developer Infrastructure",
  "type": "Talk",
  "expertise": "Intermediate",
  "tags": [
    "Developer Infrastructure"
  ],
  "speakers": [
    "sergey-nazarov"
  ],
  "sources_youtubeId": "Zu6uZ1PnRU4",
  "sources_ipfsHash": "QmRqAc5eQua2pTDd5wEq5SvtN3UAxz1Cj9zWEEgsUqCEJm",
  "sources_swarmHash": "21a1761b82904dec5c20cd9b043558e40eedd1a70eecccf1ca95088a6b519c88",
  "duration": 1237,
  "language": "en"
}